#+TODO: IDEA TODO WIP | DONE CANCELED

* musci_helper todo's

  Here is a summary of all ideas / task that have been done / will be done.

** DONE dl utility [8/8] [100%]
   CLOSED: [2019-06-14 Fri 16:45]
   :LOGBOOK:
   CLOCK: [2019-06-14 Fri 15:40]--[2019-06-14 Fri 16:44] =>  1:04
   CLOCK: [2019-06-14 Fri 14:16]--[2019-06-14 Fri 14:40] =>  0:24
   :END:
- [X] cli params
- [X] conf files [3/3] [100%]
  - [X] yt
  - [X] dl
  - [X] ignore `#`
- [X] install if not
- [X] dl
- [X] waiter
- [X] read config file
- [X] logger
- [X] doc [2/2] [100%]
  - [X] conf file
  - [X] running

** WIP sync utility [7/8] [87%]
   :LOGBOOK:
   CLOCK: [2019-06-14 Fri 21:12]--[2019-06-14 Mon 23:12] =>  2:00
   CLOCK: [2019-06-14 Fri 16:55]--[2019-06-14 Fri 17:14] =>  0:19
   :END:
- [X] cli param [3/3] [100%]
  - [X] connect ip
  - [X] sync out path
  - [X] sync in path
- [X] conf file
- [X] install if not
- [X] connect : addr
- [X] sync
- [X] waiter ?
- [X] logger
- [ ] doc

** Fixes [0/0] [0%]
*** dl [0/0] [0%]
*** sync [0/0] [0%]

** Enhancement [0/2] [0%]
*** dl [0/0] [0%]
*** sync [0/0] [0%]
*** IDEA a wrapper  [0/2] [0%]
    - [ ] some cli management
    - [ ] a logging option ?
*** IDEA a simple api to access the scirpt ? [0/0] [0%]
